{
  "backend/main.mo": "Main Motoko actor implementing user profiles, text/audio notifications system with access control, blob storage mixins, and notification management using Maps and Sets.",
  "feature_evidence.json": "Feature evidence report documenting the green checkmark icon color update in PaymentSuccess component with high confidence.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including components, pages, hooks, and utilities for the PhonePe-styled payment and notification application.",
  "frontend/index.css": "Global CSS with Tailwind layers defining OKLCH color system variables for light and dark modes with PhonePe-inspired purple palette.",
  "frontend/index.html": "HTML entry point with root div and module script reference for the PhonePe Payment Prank application.",
  "frontend/src/App.tsx": "Root application component with QueryClient, InternetIdentity providers, section navigation between payments and notifications, and header with logo and login button.",
  "frontend/src/components/AudioPlayer.tsx": "Audio player component with play/pause controls, progress bar, and time display supporting both Blob and ExternalBlob audio sources.",
  "frontend/src/components/AudioRecorder.tsx": "Audio recording UI component with visual recording indicators, preview playback, re-record functionality, and audio blob callback.",
  "frontend/src/components/LoginButton.tsx": "Login/logout button component managing Internet Identity authentication with loading states and query cache clearing on logout.",
  "frontend/src/components/Navigation.tsx": "Tab navigation component for switching between Payments and Notifications sections with active state styling and icons.",
  "frontend/src/components/NotificationComposer.tsx": "React component for composing and sending text or audio notifications to recipients, with form validation, error handling, and success feedback using tabs to switch between message types.",
  "frontend/src/components/NotificationInbox.tsx": "React component displaying a list of user notifications with read/unread status, timestamp formatting, and support for both text and audio message types with click-to-mark-as-read functionality.",
  "frontend/src/components/PaymentForm.tsx": "React form component for initiating money transfers with validation for receiver name, 10-digit phone number, and payment amount fields.",
  "frontend/src/components/PaymentSuccess.tsx": "React component displaying a success screen after payment completion with transaction details including amount, receiver info, transaction ID, and timestamp.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog component for first-time user profile setup, collecting name and preferred language with non-dismissible behavior until completed.",
  "frontend/src/hooks/useActor.ts": "React Query hook managing the backend actor instance with Internet Identity authentication, automatic re-initialization on identity changes, and admin token setup from URL parameters.",
  "frontend/src/hooks/useAudioRecorder.ts": "Custom React hook providing audio recording functionality using MediaRecorder API with state management for recording, stopping, and resetting audio capture to WebM format.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useNotifications.ts": "Exports React Query hooks for fetching user notifications (with 5-second polling) and marking notifications as read, with automatic cache invalidation.",
  "frontend/src/hooks/useSendNotification.ts": "Provides React Query mutations for sending text and audio notifications to recipients, invalidating the notifications cache on success.",
  "frontend/src/hooks/useUserProfile.ts": "Exports hooks for fetching the caller's user profile and saving/updating user profiles with automatic query cache invalidation.",
  "frontend/src/hooks/useUsers.ts": "Provides React Query hooks to fetch all users and retrieve individual user profiles by userId.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with PhonePe purple-themed color variables using OKLCH color space for both light and dark modes.",
  "frontend/src/lib/utils.ts": "Utility function that merges Tailwind CSS classes using clsx and tailwind-merge for conditional styling.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/NotificationsPage.tsx": "Main notifications page that displays login prompt for unauthenticated users, profile setup modal for new users, and notification composer/inbox for authenticated users.",
  "frontend/src/pages/PaymentPage.tsx": "Payment page component that manages payment form submission and displays payment success screen with transaction details.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from query strings or hash-based routing, with sessionStorage persistence and cleanup capabilities.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes (including PhonePe branding), container settings, animations, and plugin integrations for typography and container queries.",
  "project_state.json": "Project state file tracking a PhonePe payment prank app with in-app notifications, audio recording, and manual recipient name entry. Contains 10 implemented features including payment forms, success screens, notification composer with audio recording, and inbox interface."
}