{
  "backend/main.mo": "Main Motoko actor implementing user profiles, text/audio notifications system with access control, blob storage mixins, and notification management using Maps and Sets.",
  "feature_evidence.json": "Feature evidence report documenting PaymentSuccess component UI changes including two-tone background, recipient/sender display, checkmark positioning, and bank details with high confidence test mappings.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components including payment forms, notifications, audio recording, user profiles, and React Query hooks with PhonePe-inspired styling.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes using OKLCH color system, defining design tokens for backgrounds, borders, and UI elements.",
  "frontend/index.html": "HTML entry point with viewport meta tags and root div mounting the React application titled 'PhonePe Payment Prank'.",
  "frontend/src/App.tsx": "Root React component providing QueryClient and InternetIdentity context, managing navigation between payments and notifications sections with fixed header containing logo and login button.",
  "frontend/src/components/AudioPlayer.tsx": "Audio playback component supporting both Blob and ExternalBlob sources with play/pause controls, progress bar, and formatted time display.",
  "frontend/src/components/AudioRecorder.tsx": "Audio recording UI with visual recording indicator, preview playback using AudioPlayer, and re-record functionality that calls onAudioReady callback when complete.",
  "frontend/src/components/LoginButton.tsx": "A button component that handles Internet Identity authentication, toggling between login and logout states with loading indicators and error handling for duplicate authentication.",
  "frontend/src/components/Navigation.tsx": "A navigation bar component with two tabs (Payments and Notifications) that allows switching between sections with visual active state indicators.",
  "frontend/src/components/NotificationComposer.tsx": "A form component for composing and sending text or audio notifications to recipients, with tabs for message type selection, audio recording support, and error/success feedback.",
  "frontend/src/components/NotificationInbox.tsx": "Displays a list of user notifications with read/unread status, timestamps, and support for both text and audio messages, allowing users to mark notifications as read.",
  "frontend/src/components/PaymentForm.tsx": "A form component for initiating money transfers with fields for receiver name, phone number, and amount, including validation for 10-digit phone numbers and numeric amounts.",
  "frontend/src/components/PaymentSuccess.tsx": "A success screen component displaying payment confirmation with a checkmark animation, amount paid, receiver details, and sender information in a green-and-white gradient layout.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog for first-time user profile setup, collecting name and preferred language with a non-dismissible overlay until profile is saved.",
  "frontend/src/hooks/useActor.ts": "React hook that manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity state and initializing access control with admin tokens from URL parameters.",
  "frontend/src/hooks/useAudioRecorder.ts": "React hook that provides audio recording functionality using the MediaRecorder API, managing recording state (idle/recording/stopped), capturing audio as webm/opus blobs, and handling microphone permissions.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login/logout flows, identity persistence in local storage, and delegation validity checks with configurable AuthClient options.",
  "frontend/src/hooks/useNotifications.ts": "React Query hooks for fetching user notifications with 5-second polling and marking notifications as read, with automatic cache invalidation on mutations.",
  "frontend/src/hooks/useSendNotification.ts": "React Query mutation hooks for sending text and audio notifications to recipients via the backend actor, invalidating notification queries on success.",
  "frontend/src/hooks/useUserProfile.ts": "React Query hooks for fetching the caller's user profile and saving profile updates, with automatic cache invalidation and actor availability checks.",
  "frontend/src/hooks/useUsers.ts": "React Query hooks for fetching all users and individual user profiles by ID from the backend actor.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom PhonePe purple theme colors, light/dark mode variables, and base styling for the application using CSS custom properties.",
  "frontend/src/lib/utils.ts": "Utility function that combines clsx and tailwind-merge for conditional CSS class name merging with Tailwind CSS conflict resolution.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/NotificationsPage.tsx": "Main notifications page that displays login prompt for unauthenticated users, profile setup modal for new users, and notification composer/inbox for authenticated users with profiles.",
  "frontend/src/pages/PaymentPage.tsx": "Payment page component that manages payment flow state, showing PaymentForm for input and PaymentSuccess screen after submission with generated transaction details.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from query strings or hash-based routing, with sessionStorage persistence and functions to clear sensitive parameters from the URL.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file defining custom color schemes (including PhonePe branding colors using oklch), container settings, border radius variables, animations (accordion), and integrating typography, container queries, and animate plugins.",
  "project_state.json": "Project state document describing a PhonePe payment prank app with payment form, success screen, in-app notification system with text/audio messages, manual recipient name entry, and browser-based audio recording using Web Audio API."
}